{
  "architectures": [
    "SiglipForImageClassification"
  ],
  "dtype": "float32",
  "id2label": {
    "0": "Aland",
    "1": "Albania",
    "2": "American Samoa",
    "3": "Andorra",
    "4": "Antarctica",
    "5": "Argentina",
    "6": "Armenia",
    "7": "Australia",
    "8": "Austria",
    "9": "Bangladesh",
    "10": "Belarus",
    "11": "Belgium",
    "12": "Bermuda",
    "13": "Bhutan",
    "14": "Bolivia",
    "15": "Botswana",
    "16": "Brazil",
    "17": "Bulgaria",
    "18": "Cambodia",
    "19": "Canada",
    "20": "Chile",
    "21": "China",
    "22": "Colombia",
    "23": "Costa Rica",
    "24": "Croatia",
    "25": "Curacao",
    "26": "Czechia",
    "27": "Denmark",
    "28": "Dominican Republic",
    "29": "Ecuador",
    "30": "Egypt",
    "31": "Estonia",
    "32": "Eswatini",
    "33": "Faroe Islands",
    "34": "Finland",
    "35": "France",
    "36": "Germany",
    "37": "Ghana",
    "38": "Gibraltar",
    "39": "Greece",
    "40": "Greenland",
    "41": "Guam",
    "42": "Guatemala",
    "43": "Hong Kong",
    "44": "Hungary",
    "45": "Iceland",
    "46": "India",
    "47": "Indonesia",
    "48": "Iraq",
    "49": "Ireland",
    "50": "Isle of Man",
    "51": "Israel",
    "52": "Italy",
    "53": "Japan",
    "54": "Jersey",
    "55": "Jordan",
    "56": "Kenya",
    "57": "Kyrgyzstan",
    "58": "Laos",
    "59": "Latvia",
    "60": "Lebanon",
    "61": "Lesotho",
    "62": "Lithuania",
    "63": "Luxembourg",
    "64": "Macao",
    "65": "Madagascar",
    "66": "Malaysia",
    "67": "Malta",
    "68": "Martinique",
    "69": "Mexico",
    "70": "Monaco",
    "71": "Mongolia",
    "72": "Montenegro",
    "73": "Mozambique",
    "74": "Myanmar",
    "75": "Nepal",
    "76": "Netherlands",
    "77": "New Zealand",
    "78": "Nigeria",
    "79": "North Macedonia",
    "80": "Northern Mariana Islands",
    "81": "Norway",
    "82": "Pakistan",
    "83": "Palestine",
    "84": "Paraguay",
    "85": "Peru",
    "86": "Philippines",
    "87": "Pitcairn Islands",
    "88": "Poland",
    "89": "Portugal",
    "90": "Puerto Rico",
    "91": "Qatar",
    "92": "Reunion",
    "93": "Romania",
    "94": "Russia",
    "95": "San Marino",
    "96": "Senegal",
    "97": "Serbia",
    "98": "Singapore",
    "99": "Slovakia",
    "100": "Slovenia",
    "101": "South Africa",
    "102": "South Georgia and South Sandwich Islands",
    "103": "South Korea",
    "104": "South Sudan",
    "105": "Spain",
    "106": "Sri Lanka",
    "107": "Svalbard and Jan Mayen",
    "108": "Sweden",
    "109": "Switzerland",
    "110": "Taiwan",
    "111": "Tanzania",
    "112": "Thailand",
    "113": "Tunisia",
    "114": "Turkey",
    "115": "US Virgin Islands",
    "116": "Uganda",
    "117": "Ukraine",
    "118": "United Arab Emirates",
    "119": "United Kingdom",
    "120": "United States",
    "121": "Uruguay",
    "122": "Venezuela",
    "123": "Vietnam"
  },
  "initializer_factor": 1.0,
  "label2id": {
    "Aland": 0,
    "Albania": 1,
    "American Samoa": 2,
    "Andorra": 3,
    "Antarctica": 4,
    "Argentina": 5,
    "Armenia": 6,
    "Australia": 7,
    "Austria": 8,
    "Bangladesh": 9,
    "Belarus": 10,
    "Belgium": 11,
    "Bermuda": 12,
    "Bhutan": 13,
    "Bolivia": 14,
    "Botswana": 15,
    "Brazil": 16,
    "Bulgaria": 17,
    "Cambodia": 18,
    "Canada": 19,
    "Chile": 20,
    "China": 21,
    "Colombia": 22,
    "Costa Rica": 23,
    "Croatia": 24,
    "Curacao": 25,
    "Czechia": 26,
    "Denmark": 27,
    "Dominican Republic": 28,
    "Ecuador": 29,
    "Egypt": 30,
    "Estonia": 31,
    "Eswatini": 32,
    "Faroe Islands": 33,
    "Finland": 34,
    "France": 35,
    "Germany": 36,
    "Ghana": 37,
    "Gibraltar": 38,
    "Greece": 39,
    "Greenland": 40,
    "Guam": 41,
    "Guatemala": 42,
    "Hong Kong": 43,
    "Hungary": 44,
    "Iceland": 45,
    "India": 46,
    "Indonesia": 47,
    "Iraq": 48,
    "Ireland": 49,
    "Isle of Man": 50,
    "Israel": 51,
    "Italy": 52,
    "Japan": 53,
    "Jersey": 54,
    "Jordan": 55,
    "Kenya": 56,
    "Kyrgyzstan": 57,
    "Laos": 58,
    "Latvia": 59,
    "Lebanon": 60,
    "Lesotho": 61,
    "Lithuania": 62,
    "Luxembourg": 63,
    "Macao": 64,
    "Madagascar": 65,
    "Malaysia": 66,
    "Malta": 67,
    "Martinique": 68,
    "Mexico": 69,
    "Monaco": 70,
    "Mongolia": 71,
    "Montenegro": 72,
    "Mozambique": 73,
    "Myanmar": 74,
    "Nepal": 75,
    "Netherlands": 76,
    "New Zealand": 77,
    "Nigeria": 78,
    "North Macedonia": 79,
    "Northern Mariana Islands": 80,
    "Norway": 81,
    "Pakistan": 82,
    "Palestine": 83,
    "Paraguay": 84,
    "Peru": 85,
    "Philippines": 86,
    "Pitcairn Islands": 87,
    "Poland": 88,
    "Portugal": 89,
    "Puerto Rico": 90,
    "Qatar": 91,
    "Reunion": 92,
    "Romania": 93,
    "Russia": 94,
    "San Marino": 95,
    "Senegal": 96,
    "Serbia": 97,
    "Singapore": 98,
    "Slovakia": 99,
    "Slovenia": 100,
    "South Africa": 101,
    "South Georgia and South Sandwich Islands": 102,
    "South Korea": 103,
    "South Sudan": 104,
    "Spain": 105,
    "Sri Lanka": 106,
    "Svalbard and Jan Mayen": 107,
    "Sweden": 108,
    "Switzerland": 109,
    "Taiwan": 110,
    "Tanzania": 111,
    "Thailand": 112,
    "Tunisia": 113,
    "Turkey": 114,
    "US Virgin Islands": 115,
    "Uganda": 116,
    "Ukraine": 117,
    "United Arab Emirates": 118,
    "United Kingdom": 119,
    "United States": 120,
    "Uruguay": 121,
    "Venezuela": 122,
    "Vietnam": 123
  },
  "model_type": "siglip",
  "problem_type": "single_label_classification",
  "text_config": {
    "attention_dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "max_position_embeddings": 64,
    "model_type": "siglip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "projection_size": 768,
    "vocab_size": 256000
  },
  "transformers_version": "4.57.1",
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "image_size": 224,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16
  }
}
